var compile = function (functionObject) {
  return functionObject.toString().match(/\/\*([\s\S]*?)\*\//)[1];
};

var html_0204_01 = compile(function () {
  /*
            <div class="entry-name">
              立春：简介
            </div>
            <div class="entry-desc">
              <img class="picture" src="图标\\0204立春\\标题.jpg" width="200px" height="150px" alt="" ><p>立春是二十四节气的第一个节气。每年2月3日至5日，太阳到达黄经315°时。“立”是“开始”的意思，立春是天文意义上春天的开始。
              立春之后，万物复苏、生机勃勃，四季交替周而复始。立春期间，气温上升，日照、降雨趋于增多，对全国大多数地区来说，立春
              即是春天的前奏。古代将立春分为三候：“一候东风解冻，二候蜇虫始振，三候鱼陟负冰”（《月令七十二候集解》）。此时东风送
              暖，大地开始解冻，蛰居的虫类在洞中苏醒，河里的冰开始融化，浮游的鱼如同背负着水面的碎冰。</p>
            </div>
 */
});
var html_0204_02 = compile(function () {
  /*
            <div class="entry-name">
              立春：星象
            </div>
            <div class="entry-desc">
              <img class="picture" src="图标\\0204立春\\星象.png" width="200px" height="150px" alt="" >
              <p>立春时节，此时的星空常是一年中最璀璨的。晚上八九点左右，抬头望向星空，在正南方，有三颗星非常容易
              辨认。它们距离相近，连成一条直线，好像一条闪亮的腰带。那就是参宿一、参宿二和参宿三。中国民间将这三
              颗星称为“禄、福、寿”，把这三颗星看成三个吉祥的星官，分别掌管人世间的福份、寿命等，又称“福禄寿三星”
              。“三星高照，新春来到”，当夜晚看见三星高挂南天，正是立春节之时。</p>
            </div>
 */
});
var html_0204_03 = compile(function () {
  /*
            <div class="entry-name">
              立春：气象
            </div>
            <div class="entry-desc">
              <p>立春以后，白天逐渐增长，气温慢慢回升，土壤由下层开始化冻，这期间仍有强寒潮侵袭，天气干旱，
              常有大风和降雪。大部分地区陆续进入春耕大忙季节，农业生产仍要预防低温和雨雪天气带来的不利影响，
              需要抓紧对越冬作物的田间管理，防冻保苗。</p>
              <p>“一年之计在于春”，立春也是最受农民重视的节气。有关立春的天气谚语很多，如以晴天无雨为依据的
              有“立春晴，雨水匀”、“立春晴，一春晴”；以雨雪为依据的有“立春雨淋淋，阴阴湿湿到清明”、“打春下
              大雪，百日还大雨”；以雷电为依据的有“雷打立春节，惊蛰雨不歇”、“立春一声雷，一月不见天”；以冷暖
              为依据的有“立春寒，一春暖”；以风力为依据的有“立春北风雨水多”、“立春东风回暖早”、“立春西风回暖迟
              ”等等。</p>
            </div>
 */
});
var html_0204_04 = compile(function () {
  /*
            <div class="entry-name">
              立春：诗词
            </div>
            <div class="entry-desc">
              <img class="picture" src="图标\\0204立春\\诗词.png" width="200px" height="150px" alt="" >
              <p>《咏廿四气诗·立春正月节》唐·元稹</p>
 <p>春冬移律吕，天地换星霜。冰泮游鱼跃，和风待柳芳。</p>
  <p>早梅迎雨水，残雪怯朝阳。万物含新意，同欢圣日长。</p>
  <h>《题望苑驿》唐·温庭筠</h>
<p>弱柳千条杏一枝，半含春雨半垂丝。</p>
<p>景阳寒井人难到，长乐晨钟鸟自知。</p>
<p>花影至今通博望，树名从此号相思。</p>
<p>分明十二楼前月，不向西陵照盛姬。</p>
<p>春争日，夏争时，一年大事不宜迟。</p>

            </div>
 */
});

var html_0204_05 = compile(function () {
  /*
            <div class="entry-name">
              立春：养生
            </div>
            <div class="entry-desc">
              <p>中医认为，春季养生主要是护肝。在精神养生方面，需戒暴怒，更忌忧郁，保持心胸开阔、心境愉悦。在饮食方面，宜清淡，切勿过度食用干燥、辛辣的食物，可适当多吃姜、蒜、洋葱、芹菜等食物，杀菌散寒，有利于预防感冒等春季多发的呼吸道疾病。立春过后，天气变化较大，我国多地依旧寒冷，要注意防风保暖，多吃温补食物。同时，还要注意预防呼吸道、肝脏等方面的疾病。</p>
            </div>
 */
});
var html_0204_06 = compile(function () {
  /*
            <div class="entry-name">
              立春：农事
            </div>
            <div class="entry-desc">
              <img class="picture" src="图标\\0204立春\\农事.jpg" width="200px" height="150px" alt="" >
              <p>立春时节，万物复苏；田间地头，一派繁忙。各地农民抢抓农时，准备农具、翻整田地、播种施肥……积极开展春耕备耕和生产，呈现出人勤春早的热闹景象。
“立春一年端，种地早盘算。”对农户来说，立春是一年繁忙农事的开端，要垦多少田地、备多少种子、施多少肥料，都已经盘算好，立春就要着手干起来。旱垡地抓紧耙耱保墒。及时检查薯窖、菜窖。修置农具，兴修水利。
</p>
 <p>露地春番茄播种育苗（2月初），春西葫芦播种育苗（2月上旬），春甘蓝保护地育苗播种（2月上旬）。小拱棚黄瓜播种育苗（2月上旬）。</p>
 <p>小拱棚西瓜播种育苗（2月中旬）。日光温室西瓜定植（2月中旬）。
 日光温室一年两茬冬春茬韭菜收割结束（2月中旬）。</p>


            </div>
 */
});
var html_0204=[html_0204_01,html_0204_02,html_0204_03,html_0204_04,html_0204_05,html_0204_06];


function addhtml(html) {
  document.getElementById("text-info").innerHTML = html;
}
function clearhtml() {
  document.getElementById("text-info").innerHTML = "";
}
